вуз_град('ТУ София','София').
вуз_град('УАСГ','София').
вуз_град('УНСС','София').
вуз_град('НБУ','София').
вуз_град('МУ София','').
вуз_град('СУ','София').
вуз_град('НАТФИЗ','София').
вуз_град('Лесотехнически университет','София').
вуз_град('ПУ "Паисий Хилендарски"','Пловдив').
вуз_град('МУ Пловдив','Пловдив').
вуз_град('УХТ','Пловдив').
вуз_град('Аграрен университет','Пловдив').
вуз_град('ВУСИ','Пловдив').
вуз_град('Бургаски свободен университет','Бургас').
вуз_град('Икономически университет','Варна').
вуз_град('Висше Военноморско Училище „Н. Й. Вапцаров“','Варна').
вуз_град('ВУМ','Варна').
студент_вуз('Иван Петров','ТУ София').
студент_вуз('Стилиан Керанов','ТУ София').
студент_вуз('Валери Симов','ТУ София').
студент_вуз('Михаела Иванова','МУ').
студент_вуз('Симона Иванова','МУ').
студент_вуз('Пламен Добромиров','ПУ "Паисий Хилендарски"').
студент_вуз('Камен Еленков','ПУ "Паисий Хилендарски"').
студент_вуз('Захари Янакиев','Аграрен университет').
студент_вуз('Габриела Захариева','ВУСИ').
студент_вуз('Филип Стефанов','ВУМ').
студент_вуз('Тина Кирилова','СУ').
студент_възраст('Иван Петров', 31).
студент_възраст('Стилиан Керанов', 19).
студент_възраст('Валери Симов', 20).
студент_възраст('Михаела Иванова', 19).
студент_възраст('Симона Иванова', 22).
студент_възраст('Пламен Добромиров', 22).
студент_възраст('Камен Еленков', 21).
студент_възраст('Захари Янакиев', 20).
студент_възраст('Габриела Захариева', 19).
студент_възраст('Филип Стефанов', 33).
студент_възраст('Тина Кирилова', 20).
g(X,Result):-

1 < X , X \= 5,!,

Result is (X*X)*X + 3/X.

g(X,Result):-
    
(   X == 5; X == -1) ,!,

Result is X.


g(X,Result):-

X \= -1, X =< 1,!,

Result is log(abs(X+1)).

/*
 А) Кои са ВУЗ-овете
в София?
?-вуз_град(X,'София'),write(X),nl,fail
Б) Кои са студентите, учещи в
Пловдив?
?-вуз_град(Y,'Пловдив'),студент_вуз(X,Y),write(X),nl,fail
В) В
кои градове има студенти по-възрастни от 30 години? Да се изведат името на
студента и името на град, в който се намира ВУЗ-а?
?-студент_възраст(X,Y),студент_вуз(X,Z),вуз_град(Z,M),Y>30,write(X),write('-'),write(M),nl,fail,!.
2 Задача.
g(4,X),write(X),nl,fail - получава се 64,75–работи коректно
g(-1,Y),write(Y),nl,fail - получава се -1 –работи коректно
g(-10,Y),write(Y),nl,fail - и тук работи правилно(по последната формула)
*/